import React from 'react';
import { Box, Typography, Stack } from '@mui/material';
//
import Page from '../components/Page';
import { styled } from '@mui/material/styles';

//
const StyledMainSection = styled(Box)({
  overflow: 'auto',
});

const History = () => {
  return (
    <Page title="Team" sx={{paddingTop:{lg:'3rem', xs:'0rem', sm:'2rem', md:'2rem'}}}>
      <StyledMainSection>
        <Stack
          direction="row"
          alignItems="end"
          justifyContent="center"
          sx={{ minHeight: { lg: '100%' }, display: { lg: 'flex', xs: 'contents' }, direction: 'rtl' }}
        >
          <Box flex={1}>
            <Stack sx={{ padding: { lg: '2rem', sm: '1rem', md: '1rem', xs: '1rem' } }} direction="column" gap={3}>
              <Typography variant="h1" sx={{ alignSelf: 'center' }}>
                تاريخ نادي الزمالك
              </Typography>
              <Typography variant="h6" fontWeight={500}>
                نادي الزمالك للألعاب الرياضية (بالإنجليزية: Zamalek Sporting Club), أو كما يعرف اختصاراً باسم نادي
                الزمالك، هو نادٍ رياضي مصري احترافي يلعب في الدوري المصري، وهو واحد من سبعة أندية لم تهبط إلى دوري
                الدرجة الثانية، ويُعد واحد من الأندية لم يسبق لها أن هبطت من قمة كرة القدم المصرية منذ انطلاق الدوري إلى
                جانب الأهلي. تأسس نادي الزمالك للألعاب الرياضية في يناير من عام 1911 على يد البلجيكي جورج مرزباخ، غُيِّر
                الاسم بعد ذلك بعامين إلى نادي المختلط، سمُيَّ النادي في عام 1941 على اسم الملك فاروق الأول وأصبح يعرف
                باسم نادي فاروق الأول، بعد ثورة 23 يوليو غُيِّر اسم النادي مرة أخرى إلى اسمه الحالي وهو نادي الزمالك
                يحمل النادي منافسة طويلة الأمد مع الأهلي، وتسمى مبارياتهم بمباريات القمة، أو «ديربي القاهرة». الزمالك
                أحد أكثر الأندية نجاح في تاريخ كرة القدم المصرية من حيث عدد البطولات المحلية، فقد فاز بأربعة عشر لقب
                دوري، وثمانية وعشرين لقب في كأس مصر وأربعة ألقاب من كأس السوبر وأربعة عشر لقب في دوري منطقة القاهرة
                واثنين في كأس السلطان حسين. وهو أيضا من أنجح الأندية في تاريخ كرة القدم الأفريقية على صعيد البطولات
                الأفريقية إذ حقق 13 لقبا قاريا أفريقيا بفوزه ببطولة دوري أبطال أفريقيا خمس مرات، و4 مرات بكأس السوبر
                الأفريقي، وكأس الكونفيدرالية الأفريقية مرة واحدة، وكأس الكؤوس الأفريقية مرة واحدة، إضافة لحصوله على
                بطولة الكأس الأفروآسيوية مرتين. علي الجانب العربي حصل علي كأس العرب للأندية الأبطال مرة واحدة وكأس
                السوبر المصري السعودي مرتين. أحرز فريق كرة القدم بالزمالك لقب أفضل نادٍ في العالم وفق الاتحاد الدولي
                لتاريخ وإحصاءات كرة القدم وذلك في فبراير 2003. يعد فريق كرة القدم بالنادي الأكثر فوزًا بدوري أبطال
                أفريقيا في القرن العشرين، والأكثر فوزا بالبطولات القارية في القرن العشرين برصيد 9 بطولات. يبلغ عدد أعضاء
                النادي 85590 عضو. يمارس النادي عدة أنشطة رياضية أخرى غير كرة القدم مثل كرة السلة وكرة اليد وكرة الطائرة
                وغيرها وحقق النادي عدد من الإنجازات في هذه الألعاب.
              </Typography>
              {/* second section */}
              <Typography variant="h2">المنشئات</Typography>
              <Typography variant="h4">مقر النادي</Typography>
              <Typography variant="h6" fontWeight={500}>
                يوجد مقر النادي الرئيسي بمنطقة جامعة الدول العربية بمحافظة الجيزة ويقابله نادي الترسانة، النادي يمتلك 18
                حمام سباحة بينهم مجمع حمامات أوليمبى تقام عليه البطولات و7 حمامات سباحة مكان حديقة لطيف، وأخرى بجوار
                المبنى الاجتماعى كما يوجد عدد من الصالات الخاصة بألعاب جمباز والألعاب القتالية بالإضافة إلى مسجدين تم
                افتتاح الأول، ويحتوى الدور السفلي صالة ألعاب بدنية على مساحة 1200 متر بالإضافة إلى دور مخصص لتحفيظ
                القرآن خلاف ساحة المسجد الرئيسية بالإضافة إلى مسجد. كم تم تخصيص مقر كامل للفريق الكروي الأول بالنادي
                يحتوى على قاعة استشفاء للاعبين وجيم، وقاعة محاضرات، بالإضافة إلى غرف للاعبين الشباب المتواجدين بالنادي
              </Typography>
              <Typography variant="h4"> فرع 6 أكتوبر</Typography>
              <Typography variant="h6" fontWeight={500}>
                يسعى نادي الزمالك لافتتاح مقر جديد بمدينة السادس من أكتوبر قرب القرية الكونية وحي الأشجار.
              </Typography>
              {/* third sectopn */}
              <Typography variant="h2">إحصائيات ومعلومات</Typography>
              <Typography variant="h4"> عالميًا</Typography>
              <Typography variant="h6" fontWeight={500}>
                حصل على الترتيب رقم واحد على مستوى العالم في التصنيف الشهري لاتحاد الدولي لتاريخ وإحصاءات كرة القدم عن
                شهر فبراير 2003 وكان أول نادي مصري ينال هذا الشرف. <br /> صاحب الرقم القياسي في الفوز بالبطولة
                الأفروآسيوية للأندية بعد فوزه بها مرتان. <br/> أول فريق يحقق سبعة بطولات بين موسمي 2002-03 و2003-04، وهي
                كالتالي: الدوري المصري الممتاز موسم 2002–03 وكأس مصر عام 2002 وكأس السوبر المصري عام 2002 ودوري أبطال
                أفريقيا عام 2002 وكأس السوبر الأفريقي عام 2003 وبطولتين وديتين هم :دوري أبطال العرب (كأس العرب للأندية
                الأبطال حاليٌا) عام 200 3 و كأس السوبر المصري السعودي عام كأس السوبر المصري السعودي 2003.
              </Typography>
              <Typography variant="h4"> أفريقيًا </Typography>
              <Typography variant="h6" fontWeight={500}>
                يعتبر النادي الأكثر تتويجًا بالبطولات الأفريقية في القرن العشرين بعد حصولة علي دوري أبطال أفريقيا أربع
                مرات أعوام 1984 و1986 و1993و1996 وحصولة علي بطولتين من كأس السوبر الأفريقي 1997 و1994. <br /> أول فريق
                مصري يحصل علي كأس السوبر الأفريقي في عام 1994 بعد فوزه علي الأهلي بنتيجة 1-0 بهدف لأيمن منصور. الفريق
                الوحيد الذي أحتفظ بكأسين لبطولتين في أفريقيا وهما كأس بطولة دوري أبطال أفريقيا المسماة كأس أحمد سيكو
                توري بعد فوزه بالكأس للمره الثالثة في تاريخه سنة 1993. <br /> وكأس بطولة كأس السوبر الأفريقي بعد فوزه
                بالكأس للمره الثالثة في تاريخه سنة 2002. أول فريق يحمل بطولتين في أفريقيا كأن ذلك في سنة 2002 بعد الفوز
                ببطولة دوري أبطال أفريقيا وكأس السوبر الأفريقي.{' '}
              </Typography>
              <Typography variant="h4"> مصريًا </Typography>
              <Typography variant="h6" fontWeight={500}>
                أول فريق مصري يحصل علي كأس السلطان حسين أول بطولة رسمية في مصر بعد فوزه علي شرودرز بنتيجة 3-1.
                <br /> أول فريق مصري يحصل علي بطولة كأس مصر في عام 1922 بعد فوزه علي الاتحاد السكندري بنتيجة 5-0. <br />{' '}
                أول فريق يحصل علي أول بطولة دوري في مصر هي بطولة دوري منطقة القاهرة موسم 1922–23. <br /> نال شرف لعب أول
                مباراة في تاريخ مسابقة الدوري المصري الممتاز موسم 1948–49، وفوز بالمباراة علي النادي المصري بخمسة أهداف
                مقابل هدف. صاحب أكبر انتصار في تاريخ لقاءات القمة، وكانت أكبر نتيجة هي 6-0 لصالح الزمالك في مناسبتان
                عامي (1942، 1944). <br /> صاحب 22 مباراة متتالية بلا هزيمة في كأس مصر وهو الرقم قياسي بعد أن كسر الزمالك
                الرقم السابق لنادي الأهلي عام 1986 «20 مباراة».
              </Typography>
              <Typography variant="h4"> عربيًا </Typography>
              <Typography variant="h6" fontWeight={500}>
                أول فريق مصري يحصل علي كأس العرب للأندية الأبطال في عام 2003. <br /> البطل التاريخي لكأس السوبر المصري
                السعودي.
              </Typography>
            </Stack>
          </Box>
        </Stack>
      </StyledMainSection>
    </Page>
  );
};

export default History;
